Исходник/src/Reports/ОтчетПоАвтоОсн/ОтчетПоАвтоОсн.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоАвтоОсн</name>
</mdclass:Report>

Исходник/src/InformationRegisters/ИсторияТС/ИсторияТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортныеСредства</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Исходник/src/Reports/ОтчетПоАвтоОсн/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ТабДок = ЭтаФорма.ТабДок;
	ТабДок.Очистить();
	Макет = Отчеты.ОтчетПоАвтоОсн.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.НачатьАвтогруппировкуСтрок();
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	         "ВЫБРАТЬ
	         |	ИсторияТССрезПоследних.ТранспортныеСредства КАК ТранспортныеСредства,
	         |	ИсторияТССрезПоследних.Значение КАК Водитель,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.ЭтоГруппа КАК ЭтоГруппа,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Код КАК Код,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Наименование КАК Наименование,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Тип_тс КАК Тип_тс,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Объем_двигателя КАК Объем_двигателя,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Мощность_двигателя КАК Мощность_двигателя,
	         |	ИсторияТССрезПоследних.ТранспортныеСредства.Дата_выпуска КАК Дата_выпуска
	         |ИЗ
	         |	РегистрСведений.ИсторияТС.СрезПоследних(&Дата, ) КАК ИсторияТССрезПоследних
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	ЭтоГруппа,
	         |	Код";

	Запрос.УстановитьПараметр("Дата", Дата);
	Спр = Запрос.Выполнить().Выбрать(); 
	Пока Спр.Следующий() Цикл
		Если Спр.ЭтоГруппа Тогда
			ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
			ОбластьГруппа.Параметры.Заполнить(Спр);
			ОбластьГруппа.Параметры.СсылкаГруппа = Спр.Ссылка;
			ТабДок.Вывести(ОбластьГруппа, Спр.Уровень());
		Иначе
			ОбластьЭлемент = Макет.ПолучитьОбласть("Элемент");
			ДатаВыпуска = Спр.Дата_выпуска;
			СколькоЛет = Год(ТекущаяДата()) - Год(ДатаВыпуска); 
			ОбластьЭлемент.Область("R1C3").Примечание.Текст = Спр.Наименование + " уже " + СколькоЛет + " лет";
			ОбластьЭлемент.Параметры.Заполнить(Спр);                                      
			ТабДок.Вывести(ОбластьЭлемент, Спр.Уровень()); 
		КонецЕсли;                                
	КонецЦикла; 
	ТабДок.ЗакончитьАвтогруппировкуСтрок(); 
	ТабДок.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;        
КонецПроцедуры
